<?php
return [
    //系统常用
    'lang'   => 'zh',
    '网络延迟' => '网络延迟',
    '参数错误' => '参数错误',
    '操作频繁' => '操作频繁',
    '网络异常' => '网络异常',
    '数据异常' => '数据异常',
    '成功'    => '成功',
    '数据不存在' => '数据不存在',
    '状态异常' => '状态异常',
    '非法请求' => '非法请求',
    '系统维护' => '系统维护',
    
    //登录
    '请通过邀请链接注册登录' => '请通过邀请链接注册登录',
    '请输入钱包地址' => '请输入钱包地址',
    '钱包地址不能为空' => '钱包地址不能为空',
    '钱包地址有误'    => '钱包地址有误',
    '用户已被禁止登录' => '用户已被禁止登录',
    '请填写邀请码'    => '请填写邀请码',
    '邀请码不存在'    => '邀请码不存在',
    '推荐人不存在'    => '推荐人不存在',
    
    //上传
    '请选择文件'    => '请选择文件',
    '格式错误'    => '格式错误',
    '图片大小有误'    => '图片大小有误',
    
    //提币
    '余额不足' => '余额不足',
    '提币数量不能为0' => '提币数量不能为0',
    '提币状态1' => '待审核',
    '提币状态2' => '成功',
    '提币状态3' => '失败',
    '每日提币次数' => '每日提现最多%s次',
    'withdrawal_min' => '%s个币起提',
    
    //PK
    '敬请期待' => '敬请期待',
    
    '提币数量错误' => '提币数量错误',
    '提币数量整倍数' => '提币数量为%s的倍数',
    '请选择倍数' => '请选择倍数',
    '抽奖次数不足' => '抽奖次数不足',
    '请选择签到价格' => '请选择签到价格',
    '未到下一次签到时间' => '未到下一次签到时间',
    '算力不足' => '算力不足',
    
    '只能指定伞下用户' => '只能指定伞下用户',
    '不能超过自己级别' => '不能超过自己级别',
    '此用户不可操作'  => '此用户不可操作',
    '您已经是商家' => '您已经是商家',
    '您不是商家' => '您不是商家',
    '请选择购买数量' => '请选择购买数量',
    '请输入赠送数量' => '请输入赠送数量',
    '赠送用户不存在' => '赠送用户不存在',
    '不能赠送给自己' => '不能赠送给自己',
   
    '您已经是普通节点' => '您已经是普通节点',
    '您已经是超级节点' => '您已经是超级节点',
    '您不满足开通条件' => '您不满足开通条件',
    '需要算力手续费' => '需要算力手续费s%',
    
    //分类1系统增加2系统扣除3余额提币4提币驳回5普通节点获得6管理级奖7超级节点获得
    'USDT类型1' => '系统增加',
    'USDT类型2' => '系统扣除',
    'USDT类型3' => '余额提币',
    'USDT类型4' => '提币驳回',
    'USDT类型5' => '普通节点',
    'USDT类型6' => '管理级奖',
    'USDT类型7' => '超级节点',
    
    //分类1系统增加2系统扣除3余额提币4提币驳回5签到获得6推荐加速7见点加速8团队加速9幸运抽奖
    'DOGBEE类型1' => '系统增加',
    'DOGBEE类型2' => '系统扣除',
    'DOGBEE类型3' => '余额提币',
    'DOGBEE类型4' => '提币驳回',
    'DOGBEE类型5' => '签到获得',
    'DOGBEE类型6' => '推荐加速',
    'DOGBEE类型7' => '见点加速',
    'DOGBEE类型8' => '团队加速',
    'DOGBEE类型9' => '幸运抽奖',
    
    //分类1系统增加2系统扣除3注册赠送4购买算力5签到扣除6推荐加速7见点加速8团队加速9积分兑换
    'POWER类型1' => '系统增加',
    'POWER类型2' => '系统扣除',
    'POWER类型3' => '余额提币',
    'POWER类型4' => '提币驳回',
    'POWER类型5' => '签到扣除',
    'POWER类型6' => '推荐加速',
    'POWER类型7' => '见点加速',
    'POWER类型8' => '团队加速',
    'POWER类型9' => '积分兑换',
    'POWER类型10' => '提币扣除',
    'POWER类型11' => '提币驳回',
    
    //分类1系统增加2系统扣除3开通商家4购买积分5赠送扣除6赠送获得7兑换算力
    'POINT类型1' => '系统增加',
    'POINT类型2' => '系统扣除',
    'POINT类型3' => '开通商家',
    'POINT类型4' => '购买积分',
    'POINT类型5' => '赠送扣除',
    'POINT类型6' => '赠送获得',
    'POINT类型7' => '兑换算力',
];
